## SQL problem: Employees Earning More Than Their Managers. Given a table of employees, return the employees who make more money than their managers.

In [1]:
%load_ext sql
%sql sqlite://

In [2]:
%%sql
CREATE TABLE Employee --#Create the table of employees
(
    ID        integer,
    Name      varchar(6),
    Salary    integer,
    ManagerID integer
);
INSERT INTO Employee
VALUES (1, 'Joe', 70000, 3),
       (2, 'Henry', 80000, 4),
       (3, 'Sam', 60000, Null),
       (4, 'Max', 90000, Null);
INSERT INTO Employee
VALUES(5,'Evan',100000,3);

INSERT INTO Employee (ID, Salary)
VALUES (10, 54321);

 * sqlite://
Done.
4 rows affected.
1 rows affected.
1 rows affected.

[]

In [3]:
%%sql
select * from Employee; --#display example of employees.

 * sqlite://
Done.

[(1, 'Joe', 70000, 3),
 (2, 'Henry', 80000, 4),
 (3, 'Sam', 60000, None),
 (4, 'Max', 90000, None),
 (5, 'Evan', 100000, 3),
 (10, None, 54321, None)]

In [4]:
%%sql
SELECT worker.Name as Employee --#Return worker name labeled as employee. 
FROM Employee worker --#create alias to represent employee
JOIN Employee manager --#create alias to represent manager
ON worker.ManagerID = manager.ID --#join on the worker and manager id. 
AND worker.Salary > manager.Salary --#only where the salary of the worker is greater than the manager.

 * sqlite://
Done.

[('Joe',), ('Evan',)]